# Working with a real world data-set using SQL and Python


## Objectives

After complting this lab you will be able to:

*   Understand the dataset for Chicago Public School level performance
*   Store the dataset in a MySQL database on phthonDB
*   Solve example problems to practice your SQL skills including using built-in database functions

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&download=true&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

**NOTE**:

**`Do not download`** the dataset directly from City of Chicago portal. Instead download a static copy which is a more database friendly version from this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">link</a>.

Now review some of its contents.

### Connect to the database

In [1]:
import sqlalchemy
db_url = "mysql+pymysql://root:Skior.638@localhost/pythonDB"
engine = sqlalchemy.create_engine(db_url)
engine

Engine(mysql+pymysql://root:***@localhost/pythonDB)

In [2]:
%load_ext sql

In [3]:
%sql {db_url}

### Store the dataset in a Table

In [4]:
import pandas as pd
df = pd.read_csv("ChicagoPublicSchools.csv")
df.head()

,School_ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,Freshman_on_Track_Rate__,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police_District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,...,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"
2,610185,Adlai E Stevenson Elementary School,ES,8010 S Kostner Ave,Chicago,IL,60652,(773) 535-2280,http://schoolreports.cps.edu/SchoolProgressRep...,Midway Elementary Network,...,NDA,1148427.165,1851012.215,41.747111,-87.731702,70,ASHBURN,13,8,"(41.74711093, -87.73170248)"
3,609993,Agustin Lara Elementary Academy,ES,4619 S Wolcott Ave,Chicago,IL,60609,(773) 535-4389,http://schoolreports.cps.edu/SchoolProgressRep...,Pershing Elementary Network,...,NDA,1164504.290,1873959.199,41.809757,-87.672145,61,NEW CITY,20,9,"(41.8097569, -87.6721446)"
4,610513,Air Force Academy High School,HS,3630 S Wells St,Chicago,IL,60609,(773) 535-1590,http://schoolreports.cps.edu/SchoolProgressRep...,Southwest Side High School Network,...,91.8,1175177.622,1880745.126,41.828146,-87.632794,34,ARMOUR SQUARE,11,9,"(41.82814609, -87.63279369)"

In [5]:
df.to_sql("SCHOOLS", con=engine, if_exists='replace', index=False)

In [6]:
%sql SELECT COUNT(*) FROM SCHOOLS;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(566,)]

In [7]:
# Check the table imformation
%sql SHOW TABLE STATUS

 * mysql+pymysql://root:***@localhost/pythonDB
8 rows affected.

[('CENSUS_DATA', 'InnoDB', 10, 'Dynamic', 78, 210, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 19, 14, 51, 32), datetime.datetime(2022, 1, 19, 14, 51, 32), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('CHICAGO_CRIME_DATA', 'InnoDB', 10, 'Dynamic', 533, 307, 163840, 0, 0, 0, None, datetime.datetime(2022, 1, 19, 14, 52, 59), datetime.datetime(2022, 1, 19, 14, 52, 59), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('CHICAGO_PUBLIC_SCHOOLS', 'InnoDB', 10, 'Dynamic', 546, 840, 458752, 0, 0, 0, None, datetime.datetime(2022, 1, 19, 20, 5, 53), datetime.datetime(2022, 1, 19, 14, 53, 50), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('chicago_socioeconomic_data', 'InnoDB', 10, 'Dynamic', 78, 210, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 18, 12, 17, 41), datetime.datetime(2022, 1, 18, 12, 17, 41), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('INSTRUCTOR', 'InnoDB', 10, 'Dynamic', 2, 8192, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 17, 14, 58, 56), datetime.datetime(2022, 1, 17, 15, 1, 32), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('INTERNATIONAL_STUDENT_TEST_SCORES', 'InnoDB', 10, 'Dynamic', 99, 165, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 18, 11, 1, 30), datetime.datetime(2022, 1, 18, 11, 1, 30), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('SCHOOLS', 'InnoDB', 10, 'Dynamic', 566, 28, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 19, 20, 7, 47), datetime.datetime(2022, 1, 19, 19, 17, 31), None, 'utf8mb4_0900_ai_ci', None, '', ''),
 ('STUDENT', 'InnoDB', 10, 'Dynamic', 57, 287, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 18, 11, 32, 59), datetime.datetime(2022, 1, 18, 11, 32, 59), None, 'utf8mb4_0900_ai_ci', None, '', '')]

In [8]:
%%sql 

SELECT * FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_NAME = 'SCHOOLS'

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('def', 'pythonDB', 'SCHOOLS', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 566, 28, 16384, 0, 0, 0, None, datetime.datetime(2022, 1, 19, 20, 7, 47), datetime.datetime(2022, 1, 19, 19, 17, 31), None, 'utf8mb4_0900_ai_ci', None, '', '')]

In [9]:
%%sql 

SELECT TABLE_NAME,TABLE_SCHEMA, ENGINE, CREATE_TIME
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_NAME = 'SCHOOLS'

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('SCHOOLS', 'pythonDB', 'InnoDB', datetime.datetime(2022, 1, 19, 20, 7, 47))]

In [12]:
# %sql DESCRIBE SCHOOLS

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [11]:
# type in your query to retrieve the number of columns in the SCHOOLS table
# %sql SELECT * FROM SCHOOLS LIMIT 5;

%sql SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'SCHOOLS';

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(78,)]

Double-click **here** for the solution.

<!-- Solution:

%sql select count(*) from INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'SCHOOLS';

-->

Now retrieve the the list of columns in SCHOOLS table and their column type (datatype) and length.

In [13]:
%%sql 

SELECT DISTINCT(COLUMN_NAME), COLUMN_TYPE FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'SCHOOLS' 
ORDER BY COLUMN_NAME 
LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('10th Grade PLAN (2009)', 'text'),
 ('10th Grade PLAN (2010)', 'text'),
 ('11th Grade Average ACT (2011)', 'text'),
 ('9th Grade EXPLORE (2009)', 'text'),
 ('9th Grade EXPLORE (2010)', 'text')]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT DISTINCT(COLUMN_NAME),COLUMN_TYPE FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'SCHOOLS' ORDER BY COLUMN_NAME;

-->

### Questions

1.  Is the column name for the "SCHOOL ID" attribute in upper or mixed case?: `mixed case`
2.  What is the name of "Community Area Name" column in your table? Does it have spaces?: COMMUNITY_AREA_NAME; `No`
3.  Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "\_"?

## Problems

### Problem 1

##### How many Elementary Schools are in the dataset?

In [13]:
%sql SELECT COUNT(*) FROM SCHOOLS WHERE `Elementary, Middle, or High School` = "ES" ;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(462,)]

Double-click **here** for the solution.

<!-- Solution:

%sql SELECT COUNT(*) FROM SCHOOLS WHERE `Elementary, Middle, or High School` = "ES" ;

-->

### Problem 2

##### What is the highest Safety Score?

In [14]:
%sql SELECT MAX(safety_score) AS "HIGHEST SAFETY SCORE" FROM SCHOOLS;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(99.0,)]

### Problem 3

##### Which schools have highest Safety Score?

In [15]:
%%sql 

SELECT name_of_school, safety_score FROM SCHOOLS
WHERE safety_score = (SELECT MAX(safety_score) FROM SCHOOLS);

 * mysql+pymysql://root:***@localhost/pythonDB
19 rows affected.

[('Abraham Lincoln Elementary School', 99.0),
 ('Alexander Graham Bell Elementary School', 99.0),
 ('Annie Keller Elementary Gifted Magnet School', 99.0),
 ('Augustus H Burley Elementary School', 99.0),
 ('Edgar Allan Poe Elementary Classical School', 99.0),
 ('Edgebrook Elementary School', 99.0),
 ('Ellen Mitchell Elementary School', 99.0),
 ('James E McDade Elementary Classical School', 99.0),
 ('James G Blaine Elementary School', 99.0),
 ('LaSalle Elementary Language Academy', 99.0),
 ('Mary E Courtenay Elementary Language Arts Center', 99.0),
 ('Northside College Preparatory High School', 99.0),
 ('Northside Learning Center High School', 99.0),
 ('Norwood Park Elementary School', 99.0),
 ('Oriole Park Elementary School', 99.0),
 ('Sauganash Elementary School', 99.0),
 ('Stephen Decatur Classical Elementary School', 99.0),
 ('Talman Elementary School', 99.0),
 ('Wildwood Elementary School', 99.0)]

### Problem 4

##### What are the top 10 schools with the highest "Average Student Attendance"?

In [16]:
%%sql 

SELECT name_of_school, average_student_attendance FROM SCHOOLS 
ORDER BY average_student_attendance DESC LIMIT 10;

 * mysql+pymysql://root:***@localhost/pythonDB
10 rows affected.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT name_of_school, average_student_attendance FROM SCHOOLS 
ORDER BY average_student_attendance DESC LIMIT 10;

-->

### Problem 5

##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [17]:
%%sql 

SELECT name_of_school, average_student_attendance FROM SCHOOLS 
WHERE average_student_attendance IS NOT NULL
ORDER BY average_student_attendance LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT name_of_school, average_student_attendance FROM SCHOOLS 
WHERE average_student_attendance IS NOT NULL
ORDER BY average_student_attendance LIMIT 5;

-->

### Problem 6

##### Now remove the '%' sign from the above result set for Average Student Attendance column

In [18]:
%%sql

SELECT name_of_school, REPLACE(average_student_attendance,'%','') AS AVG_ATTN_STUD FROM SCHOOLS
WHERE average_student_attendance IS NOT NULL
ORDER BY average_student_attendance LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

Double-click **here** for the solution.

<!-- Hint:

%%sql

SELECT name_of_school, REPLACE(average_student_attendance,'%','') AS AVG_ATTN_STUD FROM SCHOOLS
WHERE average_student_attendance IS NOT NULL
ORDER BY average_student_attendance LIMIT 5;

-->

### Problem 7

##### Which Schools have Average Student Attendance lower than 70%?

In [19]:
%%sql

SELECT name_of_school, average_student_attendance FROM SCHOOLS

WHERE CAST(REPLACE(average_student_attendance,'%','') AS DOUBLE) < 70
ORDER BY name_of_school;

 * mysql+pymysql://root:***@localhost/pythonDB
8 rows affected.

[('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Dyett High School', '62.50%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Orr Academy High School', '66.30%'),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Roberto Clemente Community Academy High School', '69.60%'),
 ('Wendell Phillips Academy High School', '63.00%')]

Double-click **here** for the solution.

<!-- Solution:

%%sql

SELECT name_of_school, average_student_attendance FROM SCHOOLS

WHERE CAST(REPLACE(average_student_attendance,'%','') AS DECIMAL) < 70
ORDER BY name_of_school;
     
or,

%%sql

SELECT name_of_school, average_student_attendance FROM SCHOOLS

WHERE CAST(REPLACE(average_student_attendance,'%','') AS DOUBLE) < 70
ORDER BY name_of_school;

-->

### Problem 8

##### Get the total College Enrollment for each Community Area

In [14]:
%%sql

SELECT COMMUNITY_AREA_NAME, SUM(COLLEGE_ENROLLMENT) AS "TOTAL ENROLMENT" FROM SCHOOLS
GROUP BY COMMUNITY_AREA_NAME
ORDER BY COMMUNITY_AREA_NAME ASC
LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('ALBANY PARK', Decimal('6864')),
 ('ARCHER HEIGHTS', Decimal('4823')),
 ('ARMOUR SQUARE', Decimal('1458')),
 ('ASHBURN', Decimal('6483')),
 ('AUBURN GRESHAM', Decimal('4175'))]

Double-click **here** for the solution.

<!-- Solution:

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name 

-->

### Problem 9

##### Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [21]:
%%sql 

SELECT COMMUNITY_AREA_NAME, SUM(COLLEGE_ENROLLMENT) FROM SCHOOLS 
GROUP BY COMMUNITY_AREA_NAME
ORDER BY SUM(COLLEGE_ENROLLMENT) ASC LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('OAKLAND', Decimal('140')),
 ('FULLER PARK', Decimal('531')),
 ('BURNSIDE', Decimal('549')),
 ('OHARE', Decimal('786')),
 ('LOOP', Decimal('871'))]

Double-click **here** for the solution.

<!-- Solution:

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name \
   order by TOTAL_ENROLLMENT asc \
   fetch first 5 rows only

-->

### Problem 10

##### List 5 schools with lowest safety score.

In [22]:
%%sql

SELECT NAME_OF_SCHOOL, SAFETY_SCORE FROM SCHOOLS 
WHERE SAFETY_SCORE IS NOT NULL
ORDER BY SAFETY_SCORE ASC LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('Edmond Burke Elementary School', 1.0),
 ("Luke O'Toole Elementary School", 5.0),
 ('George W Tilton Elementary School', 6.0),
 ('Foster Park Elementary School', 11.0),
 ('John Fiske Elementary School', 13.0)]

Double-click **here** for the solution.

<!-- Solution:

%%sql

SELECT NAME_OF_SCHOOL, SAFETY_SCORE FROM SCHOOLS 
WHERE SAFETY_SCORE IS NOT NULL
ORDER BY SAFETY_SCORE ASC LIMIT 5;

-->

### Problem 11

##### Get the hardship index for the community area which has College Enrollment of 4368
> First, Store **chicago_socioeconomic_data** table into the database. Download from here: <a href="https://raw.githubusercontent.com/somgent/MySQL_with_Python/main/chicago_socioeconomic_data.csv">link</a>

+ Right click and save as **"chicago_socioeconomic_data.csv"**

In [23]:
%sql SELECT * FROM chicago_socioeconomic_data LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[(1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0),
 (4.0, 'Lincoln Square', 3.4, 10.9, 8.2, 13.4, 25.5, 37524, 17.0),
 (5.0, 'North Center', 0.3, 7.5, 5.2, 4.5, 26.2, 57123, 6.0)]

In [24]:
%%sql 

SELECT community_area_name, hardship_index FROM chicago_socioeconomic_data 
WHERE community_area_name = (SELECT COMMUNITY_AREA_NAME FROM SCHOOLS
WHERE COLLEGE_ENROLLMENT = 4368);

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('North Center', 6.0)]

In [25]:
%%sql

SELECT CSD.community_area_name, CSD.hardship_index 
FROM chicago_socioeconomic_data CSD, SCHOOLS SC
WHERE CSD.community_area_name = SC.COMMUNITY_AREA_NAME
AND SC.COLLEGE_ENROLLMENT = 4368;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('North Center', 6.0)]

Double-click **here** for the solution.

<!-- Solution:

Â§ Using Sub-query

%%sql 

SELECT community_area_name, hardship_index FROM chicago_socioeconomic_data 
WHERE community_area_name = (SELECT COMMUNITY_AREA_NAME FROM SCHOOLS
WHERE COLLEGE_ENROLLMENT = 4368);

Â§ by table joining

%%sql

SELECT CSD.community_area_name, CSD.hardship_index 
FROM chicago_socioeconomic_data CSD, SCHOOLS SC
WHERE CSD.community_area_name = SC.COMMUNITY_AREA_NAME
AND SC.COLLEGE_ENROLLMENT = 4368;

-->

### Problem 12

##### Get the hardship index for the community area which has the school with the  highest enrollment.

In [26]:
%%sql

SELECT hardship_index FROM chicago_socioeconomic_data 
WHERE community_area_name = (SELECT COMMUNITY_AREA_NAME FROM SCHOOLS 
ORDER BY COLLEGE_ENROLLMENT DESC LIMIT 1);

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(6.0,)]

Double-click **here** for the solution.

<!-- Solution:

%%sql

SELECT hardship_index FROM chicago_socioeconomic_data 
WHERE community_area_name = (SELECT COMMUNITY_AREA_NAME FROM SCHOOLS 
ORDER BY COLLEGE_ENROLLMENT DESC LIMIT 1);

-->

## Summary

##### In this lab you learned how to work with a real word dataset using SQL and Python. You learned how to query columns with spaces or special characters in their names and with mixed case names. You also used built in database functions and practiced how to sort, limit, and order result sets, as well as used sub-queries and worked with multiple tables.

# Assignmemnts 

> First, Store all the table into the database. 
+ Download **CENSUS_DATA** from here: <a href="https://github.com/somgent/MySQL_with_Python/blob/main/CENSUS_DATA.csv">link</a>
+ Right click and save as **"CENSUS_DATA.csv"**
>
+ Download **CHICAGO_CRIME_DATA** from here: <a href="https://github.com/somgent/MySQL_with_Python/blob/main/CHICAGO_CRIME_DATA.csv">link</a>
+ Right click and save as **"CHICAGO_CRIME_DATA.csv"**
>
+ Download **CHICAGO_PUBLIC_SCHOOLS** from here: <a href="https://github.com/somgent/MySQL_with_Python/blob/main/CHICAGO_PUBLIC_SCHOOLS.csv">link</a>
+ Right click and save as **"CHICAGO_PUBLIC_SCHOOLS.csv"**

In [1]:
# One example
import pandas as pd

path = "/Users/skior/Documents/GitHub/Coursera/"

df = pd.read_csv(path + "CHICAGO_PUBLIC_SCHOOLS.csv", index_col=False, delimiter = ',')
df.head()

,School_ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,Freshman_on_Track_Rate__,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police_District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,...,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"
2,610185,Adlai E Stevenson Elementary School,ES,8010 S Kostner Ave,Chicago,IL,60652,(773) 535-2280,http://schoolreports.cps.edu/SchoolProgressRep...,Midway Elementary Network,...,NDA,1148427.165,1851012.215,41.747111,-87.731702,70,ASHBURN,13,8,"(41.74711093, -87.73170248)"
3,609993,Agustin Lara Elementary Academy,ES,4619 S Wolcott Ave,Chicago,IL,60609,(773) 535-4389,http://schoolreports.cps.edu/SchoolProgressRep...,Pershing Elementary Network,...,NDA,1164504.290,1873959.199,41.809757,-87.672145,61,NEW CITY,20,9,"(41.8097569, -87.6721446)"
4,610513,Air Force Academy High School,HS,3630 S Wells St,Chicago,IL,60609,(773) 535-1590,http://schoolreports.cps.edu/SchoolProgressRep...,Southwest Side High School Network,...,91.8,1175177.622,1880745.126,41.828146,-87.632794,34,ARMOUR SQUARE,11,9,"(41.82814609, -87.63279369)"

In [2]:
import sqlalchemy

db_url = "mysql+pymysql://root:S0umen.809@localhost/pythonDB"
engine = sqlalchemy.create_engine(db_url)

In [3]:
df.to_sql("CHICAGO_PUBLIC_SCHOOLS", con=engine, if_exists='replace', index=False)

+ **Problem 1: Find the total number of crimes recorded in the CRIME table.**

In [4]:
%load_ext sql

In [5]:
%sql {db_url}

In [6]:
%sql SELECT COUNT(*) AS "TOTAL CRIME" FROM CHICAGO_CRIME_DATA;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(533,)]

Double-click **here** for the solution.

<!-- Solution:

%sql SELECT COUNT(*) AS "TOTAl CRIME" FROM CHICAGO_CRIME_DATA;

-->

In [7]:
%%sql

SELECT * FROM CENSUS_DATA LIMIT 3;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[(1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0)]

In [8]:
%%sql

SELECT * FROM CHICAGO_PUBLIC_SCHOOLS LIMIT 3;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[(610038, 'Abraham Lincoln Elementary School', 'ES', '615 W Kemper Pl', 'Chicago', 'IL', 60614, '(773) 534-5720', 'http://schoolreports.cps.edu/SchoolProgressReport_Eng/Spring2011Eng_610038.pdf', 'Fullerton Elementary Network', 'NORTH-NORTHWEST SIDE COLLABORATIVE', 'No', 'Standard', 'Not on Probation', 'Level 1', 'Yes', 'Very Strong', 99.0, 'Very Strong', '99', 'Strong', 74.0, 'Strong', 66.0, 'Weak', '65', 'Strong', '70', 'Strong', '56', 'Average', '47', '96.00%', 2.0, '96.40%', '95.80%', '80.1', '43.3', '89.6', '84.9', '60.7', '62.6', '81.9', '85.2', '52', '62.4', '66.3', '77.9', 69.7, 64.4, 0.2, 0.9, 'Yellow', 'Green', '67.1', '54.5', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 813, 33, 'NDA', 1171699.458, 1915829.428, 41.92449696, -87.64452163, 7, 'LINCOLN PARK', 43, 18, '(41.92449696, -87.64452163)'),
 (610281, 'Adam Clayton Powell Paideia Community Academy Elementary School', 'ES', '7511 S South Shore Dr', 'Chicago', 'IL', 60649, '(773) 535-6650', 'http://schoolreports.cps.edu/SchoolProgressReport_Eng/Spring2011Eng_610281.pdf', 'Skyway Elementary Network', 'SOUTH SIDE COLLABORATIVE', 'No', 'Track_E', 'Not on Probation', 'Level 1', 'No', 'Average', 54.0, 'Strong', '66', 'Strong', 74.0, 'Very Strong', 84.0, 'Weak', '63', 'Strong', '76', 'Weak', '46', 'Average', '50', '95.60%', 15.7, '95.30%', '100.00%', '62.4', '51.7', '21.9', '15.1', '29', '42.8', '38.5', '27.4', '44.8', '42.7', '14.1', '34.4', 16.8, 16.5, 0.7, 1.4, 'Green', 'Green', '17.2', '27.3', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 521, 46, 'NDA', 1196129.985, 1856209.466, 41.76032435, -87.55673627, 43, 'SOUTH SHORE', 7, 4, '(41.76032435, -87.55673627)'),
 (610185, 'Adlai E Stevenson Elementary School', 'ES', '8010 S Kostner Ave', 'Chicago', 'IL', 60652, '(773) 535-2280', 'http://schoolreports.cps.edu/SchoolProgressReport_Eng/Spring2011Eng_610185.pdf', 'Midway Elementary Network', 'SOUTHWEST SIDE COLLABORATIVE', 'No', 'Standard', 'Not on Probation', 'Level 2', 'No', 'Strong', 61.0, 'NDA', 'NDA', 'Average', 50.0, 'Weak', 36.0, 'Weak', 'NDA', 'NDA', 'NDA', 'Average', '47', 'Weak', '41', '95.70%', 2.3, '94.70%', '98.30%', '53.7', '26.6', '38.3', '34.7', '43.7', '57.3', '48.8', '39.2', '46.8', '44', '7.5', '21.9', 18.3, 15.5, -0.9, -1.0, 'Red', 'Red', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 1324, 44, 'NDA', 1148427.165, 1851012.215, 41.74711093, -87.73170248, 70, 'ASHBURN', 13, 8, '(41.74711093, -87.73170248)')]

In [9]:
%%sql

SELECT * FROM CHICAGO_CRIME_DATA LIMIT 2;

 * mysql+pymysql://root:***@localhost/pythonDB
2 rows affected.

[(3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)'),
 (3406613, 'HK456306', '2004-06-26', '009XX N CENTRAL PARK AVE', '820', 'THEFT', '$500 AND UNDER', 'OTHER', 0, 0, 1112, 11, 27.0, 23.0, '6', 1152206.0, 1906127.0, 2004, 41.89827996, -87.71640551, '(41.898279962, -87.716405505)')]

+ **Problem 2: List community areas with per capita income less than 11000.**

In [10]:
%%sql 

SELECT COMMUNITY_AREA_NAME, PER_CAPITA_INCOME FROM CENSUS_DATA
WHERE PER_CAPITA_INCOME <10000;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('Riverdale', 8201)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT COMMUNITY_AREA_NAME, PER_CAPITA_INCOME FROM CENSUS_DATA
WHERE PER_CAPITA_INCOME <10000;

-->

+ **Problem 3: List all case numbers for crimes involving minors?**

In [11]:
%%sql

SELECT CASE_NUMBER FROM CHICAGO_CRIME_DATA
WHERE DESCRIPTION LIKE "%MINOR%"

 * mysql+pymysql://root:***@localhost/pythonDB
2 rows affected.

[('HL266884',), ('HK238408',)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT CASE_NUMBER FROM CHICAGO_CRIME_DATA
WHERE DESCRIPTION LIKE "%MINOR%"

-->

+ **Problem 4: List all kidnapping crimes involving a child? (children are not considered minors for the purposes of crime analysis)**

In [12]:
%%sql

SELECT * FROM CHICAGO_CRIME_DATA
WHERE PRIMARY_TYPE = 'KIDNAPPING' AND DESCRIPTION LIKE '%CHILD%'

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 0, 0, 1533, 15, 29.0, 25.0, '20', 1143050.0, 1897546.0, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT * FROM CHICAGO_CRIME_DATA
WHERE PRIMARY_TYPE = 'KIDNAPPING' AND DESCRIPTION LIKE '%CHILD%'

-->

+ **Problem 5: What kind of crimes were recorded at schools?**

In [13]:
%%sql

SELECT DISTINCT(PRIMARY_TYPE) FROM CHICAGO_CRIME_DATA
WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * mysql+pymysql://root:***@localhost/pythonDB
6 rows affected.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT DISTINCT(PRIMARY_TYPE) FROM CHICAGO_CRIME_DATA
WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'

-->

+ **Problem 6: List the average safety score for all types of schools.**

In [14]:
%%sql

SELECT `Elementary, Middle, or High School`, AVG(SAFETY_SCORE) FROM CHICAGO_PUBLIC_SCHOOLS
GROUP BY `Elementary, Middle, or High School`;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[('ES', 49.52038369304557), ('HS', 49.62352941176471), ('MS', 48.0)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT `Elementary, Middle, or High School`, AVG(SAFETY_SCORE) FROM CHICAGO_PUBLIC_SCHOOLS
GROUP BY `Elementary, Middle, or High School`;

-->

+ **Problem 7: List 5 community areas with highest % of households below poverty line.**

In [15]:
%%sql

SELECT COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM CENSUS_DATA 
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5;

 * mysql+pymysql://root:***@localhost/pythonDB
5 rows affected.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM CENSUS_DATA 
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5;

-->

+ **Problem 8: Which community area(number) is most crime prone?**

In [16]:
%%sql

SELECT COMMUNITY_AREA_NUMBER, COUNT(CASE_NUMBER) FROM CHICAGO_CRIME_DATA
WHERE COMMUNITY_AREA_NUMBER IS NOT NULL
GROUP BY COMMUNITY_AREA_NUMBER 
ORDER BY COUNT(CASE_NUMBER) DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[(25.0, 43)]

Double-click **here** for the solution.

<!-- Solution:

%%sql

SELECT COMMUNITY_AREA_NUMBER, COUNT(CASE_NUMBER) FROM CHICAGO_CRIME_DATA
WHERE COMMUNITY_AREA_NUMBER IS NOT NULL
GROUP BY COMMUNITY_AREA_NUMBER 
ORDER BY COUNT(CASE_NUMBER) DESC LIMIT 1;
LIMIT 1

-->

+ **Problem 9: Use a sub-query to find the name of the community area with highest hardship index.**

In [17]:
%%sql

SELECT COMMUNITY_AREA_NAME, HARDSHIP_INDEX FROM CENSUS_DATA
WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA);

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('Riverdale', 98.0)]

Double-click **here** for the solution.

<!-- Solution:

%%sql 

SELECT COMMUNITY_AREA_NAME, HARDSHIP_INDEX FROM CENSUS_DATA
WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA);

-->

+ **Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?**

In [18]:
%%sql

SELECT COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER FROM CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = (
    SELECT COMMUNITY_AREA_NUMBER FROM CHICAGO_CRIME_DATA
    WHERE COMMUNITY_AREA_NUMBER IS NOT NULL
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(CASE_NUMBER) DESC LIMIT 1
);

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('Austin', 25.0)]

In [19]:
%%sql 

SELECT COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER, (
    SELECT COUNT(COMMUNITY_AREA_NUMBER)
    FROM CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
    LIMIT 1) AS "TOTAL CASE"
FROM CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = (
    SELECT COMMUNITY_AREA_NUMBER
    FROM CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
    LIMIT 1
);

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[('Austin', 25.0, 43)]

Double-click **here** for the solution.

<!-- Solution:

%%sql

SELECT COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER FROM CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = (
    SELECT COMMUNITY_AREA_NUMBER FROM CHICAGO_CRIME_DATA
    WHERE COMMUNITY_AREA_NUMBER IS NOT NULL
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(CASE_NUMBER) DESC LIMIT 1
);


Note: If you want to show COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER and COUNT(CASE_NUMBER) then:

%%sql

  SELECT COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER, (
    SELECT COUNT(COMMUNITY_AREA_NUMBER)
    FROM CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
    LIMIT 1) AS "TOTAL CASE"
FROM CENSUS_DATA
WHERE COMMUNITY_AREA_NUMBER = (
    SELECT COMMUNITY_AREA_NUMBER
    FROM CHICAGO_CRIME_DATA
    GROUP BY COMMUNITY_AREA_NUMBER
    ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC
    LIMIT 1
);  

-->